Revit 2027 API
Document.NewFlexPipe(IList<XYZ>, FlexPipeType) Method
Adds a new flexible pipe into the document, using a point array and pipe type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlexPipe NewFlexPipe(
	IList<XYZ> points,
	FlexPipeType pipeType
)
Public Function NewFlexPipe (
	points As IList(Of XYZ),
	pipeType As FlexPipeType
) As FlexPipe
public:
FlexPipe^ NewFlexPipe(
	IList<XYZ^>^ points,
	FlexPipeType^ pipeType
)
member NewFlexPipe :
        points : IList<XYZ> *
        pipeType : FlexPipeType -> FlexPipe
Parameters
points IList<XYZ>
The point array indicating the path of the flexible pipe, including the end points.
pipeType FlexPipeType
 The type of the flexible pipe.
Return Value
FlexPipe
 If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument points is null.
InvalidOperationException |  Thrown when the flexible pipe cannot be created or regenerate fails.
ArgumentException | Thrown if the flexible pipe type does not exist in the given document.
See Also
Reference
Document Class
NewFlexPipe Overload
Autodesk.Revit.Creation Namespace